w10d7/wkend_todo/my_todo/app/controllers/api/todos_controller.rb

    def show
        render json: Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def update
         @todo = Todo.find(params[:id])
        if @todo.update_attributes(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "body" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["body", "not enough time"], ["updated_at", "2020-08-09 22:06:22.268016"], ["id", 1]]

    def destroy
        @todo = Todo.find(params[:id])
        @todo.destroy
        render json: Todo.all
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 3]]
SELECT "todos".* FROM "todos"